app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "8"]]
UPDATE "movies" SET "description" = ?, "updated_at" = ? WHERE "movies"."id" = 8  [["description", "The best MVC framework that exist today. "], ["updated_at", Wed, 08 May 2013 14:50:05 UTC +00:00]]
---
  def update
    @movie = Movie.find(params[:id])

    if @movie.update(movie_params)