app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("city", "comment", "created_at", "movie_id", "name", "stars", "state", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@review = @movie.reviews.new(review_params)
		if @review.save

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? ORDER BY "movies"."id" ASC LIMIT 1  [["id", 1]]
---
	def set_movie
		@movie = Movie.find(params[:movie_id])